examples/flows/compiled/try_except_catch_all/flow.mmd
flowchart TD
    %% Flow: resilient_pipeline

    router_resilient_pipeline_line_10_seq_3{{"router_resilient_pipeline_line_10_seq_3<br/><br/>p['error_type'] = 'unknown'"}}
    router_resilient_pipeline_line_6_except_2{{router_resilient_pipeline_line_6_except_2}}
    router_resilient_pipeline_line_7_seq_1{{"router_resilient_pipeline_line_7_seq_1<br/><br/>p['error_type'] = 'known'"}}
    router_resilient_pipeline_line_9_except_4{{router_resilient_pipeline_line_9_except_4}}
    __end__((( )))

    router_resilient_pipeline_line_6_except_2 --> router_resilient_pipeline_line_7_seq_1
    router_resilient_pipeline_line_9_except_4 --> router_resilient_pipeline_line_10_seq_3
    router_resilient_pipeline_line_10_seq_3 --> __end__
    router_resilient_pipeline_line_7_seq_1 --> __end__

    classDef start fill:#98FB98,stroke:#333
    classDef endnode fill:#FFA07A,stroke:#333
    classDef router fill:#F5DEB3,stroke:#333
    classDef handler fill:#ADD8E6,stroke:#333
    classDef endpoint fill:#000,stroke:#333,color:#fff
    class router_resilient_pipeline_line_10_seq_3,router_resilient_pipeline_line_6_except_2,router_resilient_pipeline_line_7_seq_1,router_resilient_pipeline_line_9_except_4 router
    class __end__ endpoint
